app/views/users/follows.html.erb

        <% @follows.each  do |follow|%>
        <% users = User.find_by(id: follow.at_user_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]