app/views/users/likes.html.erb

      <% if @user.id != @current_user.id %>
      <% if Follow.find_by(user_id: @current_user.id, at_user_id: @user.id) %>
---
SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."at_user_id" = ? LIMIT ?  [["user_id", 2], ["at_user_id", 1], ["LIMIT", 1]]

    <% @likes.each do |like| %>
    <% post = Post.find_by(id: like.post_id) %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]