app/views/users/show.html.erb

SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."at_user_id" = ? LIMIT ?  [["user_id", 2], ["at_user_id", 1], ["LIMIT", 1]]
---
        <% if @user.id != @current_user.id %>
        <% if Follow.find_by(user_id: @current_user.id, at_user_id: @user.id) %>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY created_at desc  [["user_id", 7]]
---
    </ul>
    <% @user.posts.each do |post| %>