app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "profile" = ?, "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile", "fromフーシャ村"], ["image_name", "7.jpg"], ["updated_at", "2019-07-11 08:23:24.265300"], ["id", 7]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    @user.password = params[:password]
    @user.profile = params[:profile]
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}",image.read)
    end
    if @user.save

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "profile", "password", "account_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(name: params[:name], account_name: params[:account_name],
      email: params[:email], password: params[:password],image_name: "default_user.jpg",profile: params[:profile])
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."account_name" = ? AND "users"."password" = ? LIMIT ?  [["account_name", "nami"], ["password", "nami"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(account_name: params[:account_name],password:params[:password])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? LIMIT ?  [["post_id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]
---
  def destroy
    d_user = User.find_by(id: params[:id])
    d_posts = Post.where(user_id: d_user.id)

    #削除したアカウントの投稿とそれへのいいねを削除
    d_posts.each do |post|
      if like = Like.find_by(post_id: post.id)
        like.destroy
      end
      post.destroy
    end

    d_user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = ?  [["user_id", 1]]
---
  def follows
    @user = User.find_by(id: params[:id])
    @follows = Follow.where(user_id: @user.id)